In [1]:
import pandas as pd

In [10]:
data = {
    'Имя': ['Иван', 'Анна', 'Сергей', 'Ольга', 'Иван', 'Пётр'],
    'Возраст': [21, 20, None, 22, 21, 23],
    'Оценка': ['A', 'B', 'B', 'A', 'A', None],
    'Пол': ['М', 'Ж', 'М', 'Ж', 'М', 'М']
}

In [11]:
df = pd.DataFrame(data)
df

      Имя  Возраст Оценка Пол
0    Иван     21.0      A   М
1    Анна     20.0      B   Ж
2  Сергей      NaN      B   М
3   Ольга     22.0      A   Ж
4    Иван     21.0      A   М
5    Пётр     23.0   None   М

In [13]:
# 1. Удаление дубликатов
df_cleaned = df.drop_duplicates()
df_cleaned

      Имя  Возраст Оценка Пол
0    Иван     21.0      A   М
1    Анна     20.0      B   Ж
2  Сергей      NaN      B   М
3   Ольга     22.0      A   Ж
5    Пётр     23.0   None   М

In [15]:
# 2. Удаление строк с пропущенными значениями
df_cleaned = df_cleaned.dropna()
df_cleaned

     Имя  Возраст Оценка Пол
0   Иван     21.0      A   М
1   Анна     20.0      B   Ж
3  Ольга     22.0      A   Ж

In [16]:
# 3. Приведение типа столбца 'Возраст' к целочисленному (если это необходимо)
# В данном случае после удаления NaN в столбце 'Возраст' можно безопасно преобразовать тип
df_cleaned['Возраст'] = df_cleaned['Возраст'].astype(int)
df_cleaned

     Имя  Возраст Оценка Пол
0   Иван       21      A   М
1   Анна       20      B   Ж
3  Ольга       22      A   Ж

In [17]:
df.head(1)

    Имя  Возраст Оценка Пол
0  Иван     21.0      A   М

In [18]:
df.tail(2)

    Имя  Возраст Оценка Пол
4  Иван     21.0      A   М
5  Пётр     23.0   None   М